Revit 2027 API
ParameterFilterUtilities.GetFilterableParametersInCommon Method
 Returns the filterable parameters common to the given categories.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ICollection<ElementId> GetFilterableParametersInCommon(
	Document aDoc,
	ICollection<ElementId> categories
)
Public Shared Function GetFilterableParametersInCommon (
	aDoc As Document,
	categories As ICollection(Of ElementId)
) As ICollection(Of ElementId)
public:
static ICollection<ElementId^>^ GetFilterableParametersInCommon(
	Document^ aDoc,
	ICollection<ElementId^>^ categories
)
static member GetFilterableParametersInCommon :
        aDoc : Document *
        categories : ICollection<ElementId> -> ICollection<ElementId>
Parameters
aDoc Document
 The document containing the categories and parameters to query.
categories ICollection<ElementId>
 The categories for which to determine the common parameters.
Return Value
ICollection<ElementId>
 The set of filterable parameters common to the given categories.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
A filterable category in Revit has a set of filterable parameters. The filterable parameters common to a set of categories is the intersection of all these filterable parameter sets.
This set defines the set of parameters that may be used to define a rule on a ParameterFilterElement with a certain set of categories.
See Also
Reference
ParameterFilterUtilities Class
Autodesk.Revit.DB Namespace